{
  "books": [
    {
      "id": "1",
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "isbn": "9780743273565",
      "genre": "Classic",
      "language": "English",
      "audience": "Adults",
      "location": "Living room shelf",
      "purchaseDate": "2021-07-22",
      "purchaseLocation": "Barnes & Noble",
      "price": "$15",
      "description": {
        "short": "A tale of greed, deceit, and lost love in the Roaring Twenties.",
        "long": "The Great Gatsby is a 1925 novel written by American author F. Scott Fitzgerald that follows a cast of characters living in the fictional towns of West Egg and East Egg on prosperous Long Island in the summer of 1922."
      }
    },
    {
      "id": "2",
      "title": "Harry Potter and the Sorcerer's Stone",
      "author": "J.K. Rowling",
      "isbn": "9780590353427",
      "genre": "Fantasy",
      "language": "English",
      "audience": "Children",
      "location": "Kids' room",
      "purchaseDate": "2020-11-15",
      "purchaseLocation": "Amazon",
      "price": "$22",
      "description": {
        "short": "The first adventure of Harry Potter, a boy who discovers he is a wizard.",
        "long": "Harry Potter has never been the star of a Quidditch team, scoring points while riding a broom far above the ground. He knows no spells, has never helped to hatch a dragon, and has never worn a cloak of invisibility."
      }
    },
    {
      "id": "3",
      "title": "1984",
      "author": "George Orwell",
      "isbn": "9780451524935",
      "genre": "Dystopian",
      "language": "English",
      "audience": "Adults",
      "location": "Bedroom bookcase",
      "purchaseDate": "2019-05-10",
      "purchaseLocation": "Local Bookstore",
      "price": "$18",
      "description": {
        "short": "A startling and haunting vision of the world, 1984 is so powerful that it is completely convincing from start to finish.",
        "long": "Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes."
      }
    },
    {
      "id": "4",
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "isbn": "9780316769488",
      "genre": "Literary Fiction",
      "language": "English",
      "audience": "Adults",
      "location": "Study room",
      "purchaseDate": "2022-03-14",
      "purchaseLocation": "Ebay",
      "price": "$20",
      "description": {
        "short": "A story about adolescent angst and rebellion.",
        "long": "Holden Caulfield, a teenager, is living in an unspecified institution in Southern California, near Hollywood, in 1951. Caulfield intends to live with his brother D.B, an author and World War II veteran whom Holden is angry with for becoming a screenwriter, after his release in one month."
      }
    },
    {
      "id": "5",
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "isbn": "9780061120084",
      "genre": "Classic",
      "language": "English",
      "audience": "Adults",
      "location": "Office shelf",
      "purchaseDate": "2018-09-10",
      "purchaseLocation": "Thrift Store",
      "price": "$10",
      "description": {
        "short": "A novel of racial injustice and the destruction of innocence.",
        "long": "Scout Finch lives with her brother, Jem, and their widowed father, Atticus, in the sleepy Alabama town of Maycomb. Maycomb is suffering through the Great Depression, but Atticus is a prominent lawyer and the Finch family is reasonably well off in comparison to the rest of society."
      }
    },
    {
      "id": "6",
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "isbn": "9781503290563",
      "genre": "Classic",
      "language": "English",
      "audience": "Adults",
      "location": "Guest room shelf",
      "purchaseDate": "2023-01-05",
      "purchaseLocation": "Books-A-Million",
      "price": "$12",
      "description": {
        "short": "A witty exploration of the complexities of love and manners in 19th-century England.",
        "long": "Pride and Prejudice, first published in 1813, is a novel of manners by Jane Austen. The narrative follows Elizabeth Bennet as she deals with issues of manners, upbringing, morality, education, and marriage in the society of the landed gentry of early 19th-century England. Elizabeth is the second of five daughters of a country gentleman, Mr. Bennet, living in the fictional county of Meryton."
      }
    }
  ]
}